TestCases/SiliconeExp/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3148;
        startFace       40200;
    }
    atmosphere
    {
        type            patch;
        nFaces          400;
        startFace       43348;
    }
    Inlet
    {
        type            patch;
        nFaces          52;
        startFace       43748;
    }
)

// ************************************************************************* //
