TestCases/SiliconeExp/constant/bubbleCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      bubbleCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            U               explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cellPoint;
        U               cellPoint;
        mu              cellPoint;
        alpha.water     cellPoint;
        n_hat           cellPoint;
    }

    integrationSchemes
    {
        U               Euler;
    }
}


constantProperties
{
    rho0            1.199;

    constantVolume  false;

    //Not sure whether alphaMax is actually used anywhere
    alphaMax        0.5; //CHW - Added for determination of alphac in main solver
}


subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
        InterfacePinning;
    }

    injectionModels     
    {
        model1
        {
            type            patchInjection;
            SOI             0.01;
            massTotal       20;
            parcelBasisType fixed;
            nParticle       1;
            patch           Inlet;
            duration        100;
            parcelsPerSecond 40;
            U0              (0 0 0.2);        // Inlet superficial velocity 
            flowRateProfile constant 1;
            sizeDistribution                  // Input parameter from experiment
            {
                type        uniform;
                uniformDistribution
                {
                     minValue       0.0008;
                     maxValue       0.0016;
                }

                /*
                type        fixedValue;
                fixedValueDistribution
                {
                     value       0.004;
                }
                */
            }
        }
    }

    collisionModel none;

    dispersionModel none; //stochasticDispersionRAS;

    patchInteractionModel standardWallInteraction;

    heatTransferModel none;

    compositionModel singleMixtureFraction;

    phaseChangeModel none;

    devolatilisationModel none;

    surfaceReactionModel none;

    stochasticCollisionModel none;

    surfaceFilmModel none;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  off;
    }

}

cloudFunctions
{
  
}


// ************************************************************************* //
